backend/my-skills-api/app/controllers/api/v1/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'dhiraj@gmail.com' LIMIT 1
---
  def login
    @user = User.find_by_email(params[:email])