backend/my-skills-api/app/controllers/api/v1/notes_controller.rb

  def create
    begin
      raise "Title cannot be empty" unless params[:title].strip.present?
      raise "Title must have at least 6 characters" unless params[:title].strip.length >= 6
      raise "Description cannot be empty" unless params[:description].present?
      raise "Description must have at least 10 characters" unless params[:description].strip.length >= 10
      raise "Tags cannot be empty" unless params[:tags].present?
      # raise "User id cannot be empty" unless params[:user_id].present?

      note = Note.create!(title: params[:title], description: params[:description], tags: params[:tags], user_id: @current_user.id)
---
INSERT INTO "notes" ("title", "description", "created_at", "updated_at", "user_id", "tags") VALUES ('iuagfshdckjn', 'kjznds,cjn', '2025-01-30 06:57:31.574401', '2025-01-30 06:57:31.574401', 1, '["oiesufdhkj"]') RETURNING "id"

  def update
    begin
      raise "Id not given in parameter." unless params[:id].present?
      note = Note.find_by(id: params[:id])
      raise "Id doesn't consist in table" unless note.present?
      raise "Title cannot be empty" unless params[:title].present?
      raise "Title must have at least 6 characters" unless params[:title].strip.length >= 6
      raise "Description Not Found" unless params[:description].present?
      raise "Description must have at least 10 characters" unless params[:description].length >= 10

      note.update!(title: params[:title], description: params[:description], tags: params[:tags], user_id: @current_user.id)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 14 LIMIT 1
SELECT "notes".* FROM "notes"
UPDATE "notes" SET "title" = 'React Components Tutorial', "description" = 'Detailed explanation on creating functional React components, including state, props, and lifecycle methods. Covered hooks and component reusability.', "updated_at" = '2025-01-30 12:31:10.469087', "tags" = '{react,frontend}' WHERE "notes"."id" = 14

  def destroy
    begin
      raise "Id not given in parameter." unless params[:id].present?
      note = Note.find_by(id: params[:id])
      raise "Id doesn't consist in table" unless note.present?
      if note.user_id != @current_user.id
        raise "You are not authorized to delete this note."
      end
      note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 52 LIMIT 1
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 7 LIMIT 1
DELETE FROM "notes" WHERE "notes"."id" = 52