backend/my-skills-api/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def show
    begin
      raise "Id is not present" if params[:id].blank?
      @user = User.find(params[:id])

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'dhiraj@gmail.com ' LIMIT 1
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ('test 4', 'test4@gmail.com', '$2a$12$NSwv0sSqel7nsR8xJ8RseuNVFN1KdFieulKJY6FyiceQsBnL.SC/.', '2025-01-29 06:24:57.104700', '2025-01-29 06:24:57.104700') RETURNING "id"
---
  def create
    begin
      user_params = params.require(:user).permit(:username, :email, :password)
      Rails.logger.info "Received params: #{user_params.inspect}"

      raise "Username cannot be empty" unless user_params[:username].present?
      raise "Email cannot be empty" unless user_params[:email].present?
      raise "Password cannot be empty" unless user_params[:password].present?

      if User.exists?(email: user_params[:email])
        raise "Email already exists. Try to log in."
      end

      @user = User.create!(user_params)