backend/my-skills-api/app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers["Authorization"]
    token = header.split(" ").last if header
    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1